---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsRun.StairsRunStyle
source: html/07464cfb-9532-f76a-5b25-a013dd9c93e0.htm
---
# Autodesk.Revit.DB.Architecture.StairsRun.StairsRunStyle Property

The style of the stairs run such as straight, winder, etc.

## Syntax (C#)
```csharp
public StairsRunStyle StairsRunStyle { get; }
```